pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr60431.h
/* SAPH_ACH1PUT Control Bits */
#define CH1PUT                           (0x000f)        /* */
#define CH1PUT_L                         (0x000f)
#define CH1PUT0                          (0x0001)        /* */
#define CH1PUT0_L                        (0x0001)
#define CH1PUT1                          (0x0002)        /* */
#define CH1PUT1_L                        (0x0002)
#define CH1PUT2                          (0x0004)        /* */
#define CH1PUT2_L                        (0x0004)
#define CH1PUT3                          (0x0008)        /* */
#define CH1PUT3_L                        (0x0008)

/* SAPH_ACH1PDT Control Bits */
#define CH1PDT                           (0x000f)        /* */
#define CH1PDT_L                         (0x000f)
#define CH1PDT0                          (0x0001)        /* */
#define CH1PDT0_L                        (0x0001)
#define CH1PDT1                          (0x0002)        /* */
#define CH1PDT1_L                        (0x0002)
#define CH1PDT2                          (0x0004)        /* */
#define CH1PDT2_L                        (0x0004)
#define CH1PDT3                          (0x0008)        /* */
#define CH1PDT3_L                        (0x0008)

/* SAPH_ACH1TT Control Bits */
#define CH1TT                            (0x000f)        /* */
#define CH1TT_L                          (0x000f)
#define CH1TT0                           (0x0001)        /* */
#define CH1TT0_L                         (0x0001)
#define CH1TT1                           (0x0002)        /* */
#define CH1TT1_L                         (0x0002)
#define CH1TT2                           (0x0004)        /* */
#define CH1TT2_L                         (0x0004)
#define CH1TT3                           (0x0008)        /* */
#define CH1TT3_L                         (0x0008)

/* SAPH_AMCNF Control Bits */
#define LPBE                             (0x0800)        /* */
#define LPBE_H                           (0x0008)
#define LPBE_0                           (0x0000)        /* For manual bias mode and regular ASQ bias mode. In this 
                                                            configuration the user controls by the ASQBSW has full control
                                                            over the TxBias and RxBias switches. */
#define LPBE_1                           (0x0800)        /* Low power bias mode. In this mode the ASQ uses the CHxEBSW and
                                                            PGABSW as auxiliary values to achieve faster channel setting 
                                                            on reactive input loads. The ASQ has full controls over the 
                                                            bias switch multiplexer. */
#define LPBE_1_H                         (0x0008)
#define RSV1                             (0x0600)        /* */
#define RSV1_H                           (0x0006)
#define RSV10                            (0x0200)        /* */
#define RSV10_H                          (0x0002)
#define RSV11                            (0x0400)        /* */
#define RSV11_H                          (0x0004)
#define CPEO                             (0x0100)        /* */
#define CPEO_H                           (0x0001)
#define CPEO_0                           (0x0000)        /* Charge pump is turned on by SDHS and ASQ related requests 
                                                            only. */
#define CPEO_1                           (0x0100)        /* Charge pump is turned on regardless of SDHS and ASQ related 
                                                            charge pump requests. */
#define CPEO_1_H                         (0x0001)
#define RSV0                             (0x000c)        /* */
#define RSV0_L                           (0x000c)
#define RSV00                            (0x0004)        /* */
#define RSV00_L                          (0x0004)
#define RSV01                            (0x0008)        /* */
#define RSV01_L                          (0x0008)
#define BIMP                             (0x0003)        /* */
#define BIMP_L                           (0x0003)
#define BIMP0                            (0x0001)        /* */
#define BIMP0_L                          (0x0001)
#define BIMP1                            (0x0002)        /* */
#define BIMP1_L                          (0x0002)
#define BIMP_0                           (0x0000)        /* 200 Ohms buffer impedance for RxBias and TxBias */
#define BIMP_1                           (0x0001)        /* 600 Ohms buffer impedance for RxBias and TxBias */
#define BIMP_1_L                         (0x0001)
#define BIMP_2                           (0x0002)        /* 1200 Ohms buffer impedance for RxBias and TxBias (default) */
#define BIMP_2_L                         (0x0002)
#define BIMP_3                           (0x0003)        /* 2800 Ohms buffer impedance for RxBias and TxBias */
#define BIMP_3_L                         (0x0003)

/* SAPH_ATACTL Control Bits */
#define UNLOCK                           (0x0001)        /* */
#define UNLOCK_L                         (0x0001)

/* SAPH_AICTL0 Control Bits */
#define MUXSEL                           (0x000f)        /* */
#define MUXSEL_L                         (0x000f)
#define MUXSEL0                          (0x0001)        /* */
#define MUXSEL0_L                        (0x0001)
#define MUXSEL1                          (0x0002)        /* */
#define MUXSEL1_L                        (0x0002)
#define MUXSEL2                          (0x0004)        /* */
#define MUXSEL2_L                        (0x0004)
#define MUXSEL3                          (0x0008)        /* */
#define MUXSEL3_L                        (0x0008)
#define MUXSEL_0                         (0x0000)        /* Channel 0 is selected for input */
#define MUXSEL_1                         (0x0001)        /* Channel 1 is selected for input */
#define MUXSEL_1_L                       (0x0001)
#define MUXSEL_2                         (0x0002)        /* reserved for future channels */
#define MUXSEL_2_L                       (0x0002)
#define MUXSEL_3                         (0x0003)        /* reserved for future channels */
#define MUXSEL_3_L                       (0x0003)
#define MUXSEL_4                         (0x0004)        /* reserved for future channels */
#define MUXSEL_4_L                       (0x0004)
#define MUXSEL_5                         (0x0005)        /* reserved for future channels */
#define MUXSEL_5_L                       (0x0005)
#define MUXSEL_6                         (0x0006)        /* reserved for future channels */
#define MUXSEL_6_L                       (0x0006)
#define MUXSEL_7                         (0x0007)        /* reserved for future channels */
#define MUXSEL_7_L                       (0x0007)
#define MUXSEL_8                         (0x0008)        /* no channel is selected */
#define MUXSEL_8_L                       (0x0008)
#define MUXSEL_9                         (0x0009)        /* no channel is selected */
#define MUXSEL_9_L                       (0x0009)
#define MUXSEL_10                        (0x000a)        /* no channel is selected */
#define MUXSEL_10_L                      (0x000a)
#define MUXSEL_11                        (0x000b)        /* no channel is selected */
#define MUXSEL_11_L                      (0x000b)
#define MUXSEL_12                        (0x000c)        /* no channel is selected */
#define MUXSEL_12_L                      (0x000c)
#define MUXSEL_13                        (0x000d)        /* no channel is selected */
#define MUXSEL_13_L                      (0x000d)
#define MUXSEL_14                        (0x000e)        /* no channel is selected */
#define MUXSEL_14_L                      (0x000e)
#define MUXSEL_15                        (0x000f)        /* no channel is selected */
#define MUXSEL_15_L                      (0x000f)
#define MUXSEL__CH0IN                    (0x0000)        /* Channel 0 is selected for input */
#define MUXSEL__CH1IN                    (0x0001)        /* Channel 1 is selected for input */
#define MUXSEL__CH1IN_L                  (0x0001)
#define DUMEN                            (0x0080)        /* */
#define DUMEN_L                          (0x0080)
#define DUMEN_0                          (0x0000)        /* PGA dummy input load is Hi-Z. */
#define DUMEN_1                          (0x0080)        /* PGA dummy input load matches the PGA input impedance. */
#define DUMEN_1_L                        (0x0080)
#define MUXCTL                           (0x0010)        /* */
#define MUXCTL_L                         (0x0010)
#define MUXCTL_0                         (0x0000)        /* The input multiplexer is controlled by ICTL0.MUXSEL (register 
                                                            mode) */
#define MUXCTL_1                         (0x0010)        /* The input multiplexer is controlled by ASQ (auto mode) */
#define MUXCTL_1_L                       (0x0010)
#define XPBSW0                           (0x1000)        /* */
#define XPBSW0_H                         (0x0010)
#define XPBSW0_0                         (0x0000)        /* External bias switch is open (no bias driven) */
#define XPBSW0_1                         (0x1000)        /* External  bias switch is closed (bias is driven) */
#define XPBSW0_1_H                       (0x0010)
#define XPBSW1                           (0x2000)        /* */
#define XPBSW1_H                         (0x0020)
#define XPBSW1_0                         (0x0000)        /* External bias switch is open (no bias driven) */
#define XPBSW1_1                         (0x2000)        /* External  bias switch is closed (bias is driven) */
#define XPBSW1_1_H                       (0x0020)
#define XPB0FEN                          (0x0100)        /* */
#define XPB0FEN_H                        (0x0001)
#define XPB0FEN_0                        (0x0000)        /* XPB0 pin function disabled */
#define XPB0FEN_1                        (0x0100)        /* XPB0 pin function enabled */
#define XPB0FEN_1_H                      (0x0001)
#define XPB1FEN                          (0x0200)        /* */
#define XPB1FEN_H                        (0x0002)
#define XPB1FEN_0                        (0x0000)        /* XPB1 pin function disabled */
#define XPB1FEN_1                        (0x0200)        /* XPB1 pin function enabled */
#define XPB1FEN_1_H                      (0x0002)

/* SAPH_ABCTL Control Bits */
#define ASQBSC                           (0x0001)        /* */
#define ASQBSC_L                         (0x0001)
#define ASQBSC_0                         (0x0000)        /* Bias switches are controlled by BCTL.CH0EBSW, BCTL.CH1EBSW, 
                                                            BCTL.PGABSW bits (register mode). */
#define ASQBSC_1                         (0x0001)        /* Bias switches are controlled by ASQ (auto mode) */
#define ASQBSC_1_L                       (0x0001)
#define PGABSW                           (0x0002)        /* */
#define PGABSW_L                         (0x0002)
#define PGABSW_0                         (0x0000)        /* Rx bias switch is open. */
#define PGABSW_1                         (0x0002)        /* Rx bias switch is closed (enabled). */
#define PGABSW_1_L                       (0x0002)
#define EXCBIAS                          (0x0030)        /* */
#define EXCBIAS_L                        (0x0030)
#define EXCBIAS0                         (0x0010)        /* */
#define EXCBIAS0_L                       (0x0010)
#define EXCBIAS1                         (0x0020)        /* */
#define EXCBIAS1_L                       (0x0020)
#define EXCBIAS_0                        (0x0000)        /* 0.2V nominal */
#define EXCBIAS_1                        (0x0010)        /* 0.3V nominal */
#define EXCBIAS_1_L                      (0x0010)
#define EXCBIAS_2                        (0x0020)        /* 0.4V nominal */
#define EXCBIAS_2_L                      (0x0020)
#define EXCBIAS_3                        (0x0030)        /* 0.6V nominal */
#define EXCBIAS_3_L                      (0x0030)
#define PGABIAS                          (0x00c0)        /* */
#define PGABIAS_L                        (0x00c0)
#define PGABIAS0                         (0x0040)        /* */
#define PGABIAS0_L                       (0x0040)
#define PGABIAS1                         (0x0080)        /* */
#define PGABIAS1_L                       (0x0080)
#define PGABIAS_0                        (0x0000)        /* 0.75V nominal */
#define PGABIAS_1                        (0x0040)        /* 0.8V nominal */
#define PGABIAS_1_L                      (0x0040)
#define PGABIAS_2                        (0x0080)        /* 0.9V nominal */
#define PGABIAS_2_L                      (0x0080)
#define PGABIAS_3                        (0x00c0)        /* 0.95V nominal */
#define PGABIAS_3_L                      (0x00c0)
#define CH0EBSW                          (0x0100)        /* */
#define CH0EBSW_H                        (0x0001)
#define CH0EBSW_0                        (0x0000)        /* Tx bias switch to CH0 is open. */
#define CH0EBSW_1                        (0x0100)        /* Tx bias switch to CH0 is closed (enabled). */
#define CH0EBSW_1_H                      (0x0001)
#define CH1EBSW                          (0x0200)        /* */
#define CH1EBSW_H                        (0x0002)
#define CH1EBSW_0                        (0x0000)        /* Tx bias switch to CH1 is open. */
#define CH1EBSW_1                        (0x0200)        /* Tx bias switch to CH1 is closed (enabled). */
#define CH1EBSW_1_H                      (0x0002)
#define CPDA                             (0x0008)        /* */
#define CPDA_L                           (0x0008)
#define CPDA_0                           (0x0000)        /* Turn off the charge pump during data acquisition. */
#define CPDA_1                           (0x0008)        /* Keep turning on the charge pump during data acquisition. */
#define CPDA_1_L                         (0x0008)
#define LILC                             (0x0004)        /* */
#define LILC_L                           (0x0004)
#define LILC_0                           (0x0000)        /* LICL is disabled. */
#define LILC_1                           (0x0004)        /* LICL is enabled. */
#define LILC_1_L                         (0x0004)

/* SAPH_APGC Control Bits */
#define EPULS                            (0x007f)        /* */
#define EPULS_L                          (0x007f)
#define EPULS0                           (0x0001)        /* */
#define EPULS0_L                         (0x0001)
#define EPULS1                           (0x0002)        /* */
#define EPULS1_L                         (0x0002)
#define EPULS2                           (0x0004)        /* */
#define EPULS2_L                         (0x0004)
#define EPULS3                           (0x0008)        /* */
#define EPULS3_L                         (0x0008)
#define EPULS4                           (0x0010)        /* */
#define EPULS4_L                         (0x0010)
#define EPULS5                           (0x0020)        /* */
#define EPULS5_L                         (0x0020)
#define EPULS6                           (0x0040)        /* */
#define EPULS6_L                         (0x0040)
#define SPULS                            (0x0f00)        /* */
#define SPULS_H                          (0x000f)
#define SPULS0                           (0x0100)        /* */
#define SPULS0_H                         (0x0001)
#define SPULS1                           (0x0200)        /* */
#define SPULS1_H                         (0x0002)
#define SPULS2                           (0x0400)        /* */
#define SPULS2_H                         (0x0004)
#define SPULS3                           (0x0800)        /* */
#define SPULS3_H                         (0x0008)
#define PPOL                             (0x2000)        /* */
#define PPOL_H                           (0x0020)
#define PPOL_0                           (0x0000)        /* The excitation begins with logical high phase. The stop 
                                                            begines with logical low phase. */
#define PPOL_1                           (0x2000)        /* The excitation begins with logical low phase. The stop begines
                                                            with logical high phase. */
#define PPOL_1_H                         (0x0020)
#define PLEV                             (0x4000)        /* */
#define PLEV_H                           (0x0040)
#define PLEV_0                           (0x0000)        /* PPG output is low during inactive */
#define PLEV_1                           (0x4000)        /* PPG output is high during inactive */
#define PLEV_1_H                         (0x0040)
#define PHIZ                             (0x8000)        /* */
#define PHIZ_H                           (0x0080)
#define PHIZ_0                           (0x0000)        /* PPG output during inactive is determined by PGC.PLEV bit. */
#define PHIZ_1                           (0x8000)        /* PPG output is in Hi-Z during inactive regardless of PGC.PLEV 
                                                            bit. */
#define PHIZ_1_H                         (0x0080)

/* SAPH_APGLPER Control Bits */
#define LPER                             (0x00ff)        /* */
#define LPER_L                           (0x00ff)
#define LPER0                            (0x0001)        /* */
#define LPER0_L                          (0x0001)
#define LPER1                            (0x0002)        /* */
#define LPER1_L                          (0x0002)
#define LPER2                            (0x0004)        /* */
#define LPER2_L                          (0x0004)
#define LPER3                            (0x0008)        /* */
#define LPER3_L                          (0x0008)
#define LPER4                            (0x0010)        /* */
#define LPER4_L                          (0x0010)
#define LPER5                            (0x0020)        /* */
#define LPER5_L                          (0x0020)
#define LPER6                            (0x0040)        /* */
#define LPER6_L                          (0x0040)
#define LPER7                            (0x0080)        /* */
#define LPER7_L                          (0x0080)

/* SAPH_APGHPER Control Bits */
#define HPER                             (0x00ff)        /* */
#define HPER_L                           (0x00ff)
#define HPER0                            (0x0001)        /* */
#define HPER0_L                          (0x0001)
#define HPER1                            (0x0002)        /* */
#define HPER1_L                          (0x0002)
#define HPER2                            (0x0004)        /* */
#define HPER2_L                          (0x0004)
#define HPER3                            (0x0008)        /* */
#define HPER3_L                          (0x0008)
#define HPER4                            (0x0010)        /* */
#define HPER4_L                          (0x0010)
#define HPER5                            (0x0020)        /* */
#define HPER5_L                          (0x0020)
#define HPER6                            (0x0040)        /* */
#define HPER6_L                          (0x0040)
#define HPER7                            (0x0080)        /* */
#define HPER7_L                          (0x0080)

/* SAPH_APGCTL Control Bits */
#define PGSEL                            (0x0001)        /* */
#define PGSEL_L                          (0x0001)
#define PGSEL_0                          (0x0000)        /* PPG output channel is selected by PGCTL.PPGCHSEL bit (register
                                                            mode). */
#define PGSEL_1                          (0x0001)        /* PPG output channel is selected by ASQ (auto mode). */
#define PGSEL_1_L                        (0x0001)
#define PPGCHSEL                         (0x0002)        /* */
#define PPGCHSEL_L                       (0x0002)
#define PPGCHSEL_0                       (0x0000)        /* CH0 is selected */
#define PPGCHSEL_1                       (0x0002)        /* CH1 is selected */
#define PPGCHSEL_1_L                     (0x0002)
#define TRSEL                            (0x0030)        /* */
#define TRSEL_L                          (0x0030)
#define TRSEL0                           (0x0010)        /* */
#define TRSEL0_L                         (0x0010)
#define TRSEL1                           (0x0020)        /* */
#define TRSEL1_L                         (0x0020)
#define TRSEL_0                          (0x0000)        /* Writing 1 to PPGTRIG.PPGTRIG to trigger the PPG (start pulse 
                                                            generation). */
#define TRSEL_1                          (0x0010)        /* PPG trigger is controlled by the ASQ. */
#define TRSEL_1_L                        (0x0010)
#define TRSEL_2                          (0x0020)        /* Ext. Signal (See device specific datasheet) */
#define TRSEL_2_L                        (0x0020)
#define TRSEL_3                          (0x0030)        /* Ext. Signal (See device specific datasheet) */
#define TRSEL_3_L                        (0x0030)
#define PPGEN                            (0x0200)        /* */
#define PPGEN_H                          (0x0002)
#define PPGEN_0                          (0x0000)        /* PPG trigger is disabled. */
#define PPGEN_1                          (0x0200)        /* PPG trigger is enabled. */
#define PPGEN_1_H                        (0x0002)
#define TONE                             (0x4000)        /* */
#define TONE_H                           (0x0040)
#define TONE_0                           (0x0000)        /* Test tone generation is disabled.  Note: This bit is 
                                                            automatically cleared when writing '1' to PGCTL.STOP, and it 
                                                            stops test tone generation immediately. */
#define TONE_1                           (0x0000)        /* Test tone generation is enabled. */
#define TONE__DISABLE                    (0x0000)        /* Test tone generation is disabled.  Note: This bit is 
                                                            automatically cleared when writing '1' to PGCTL.STOP, and it 
                                                            stops test tone generation immediately. */
#define TONE__ENABLE                     (0x0000)        /* Test tone generation is enabled. */
#define PPGSTOP                          (0x8000)        /* */
#define PPGSTOP_H                        (0x0080)
#define PSCEN                            (0x2000)        /* */
#define PSCEN_H                          (0x0020)
#define PSCEN_0                          (0x0000)        /* Prescaler is disabled. PPG clock = PLL output clock. */
#define PSCEN_1                          (0x2000)        /* Prescaler by four is enabled. PPG clock = 1/4 of the PLL 
                                                            output clock. */
#define PSCEN_1_H                        (0x0020)
#define PSCEN__DISABLE                   (0x0000)        /* Prescaler is disabled. PPG clock = PLL output clock. */
#define PSCEN__ENABLE                    (0x2000)        /* Prescaler by four is enabled. PPG clock = 1/4 of the PLL 
                                                            output clock. */
#define PSCEN__ENABLE_H                  (0x0020)

/* SAPH_APPGTRIG Control Bits */
#define PPGTRIG                          (0x0001)        /* */
#define PPGTRIG_L                        (0x0001)

