pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr60431.h
/* SAPH_AATM_B Control Bits */
#define TIMEMARK_B                       (0xffff)        /* */
#define TIMEMARK_B_L                     (0x00ff)
#define TIMEMARK_B_H                     (0x00ff)
#define TIMEMARK_B0                      (0x0001)        /* */
#define TIMEMARK_B0_L                    (0x0001)
#define TIMEMARK_B1                      (0x0002)        /* */
#define TIMEMARK_B1_L                    (0x0002)
#define TIMEMARK_B2                      (0x0004)        /* */
#define TIMEMARK_B2_L                    (0x0004)
#define TIMEMARK_B3                      (0x0008)        /* */
#define TIMEMARK_B3_L                    (0x0008)
#define TIMEMARK_B4                      (0x0010)        /* */
#define TIMEMARK_B4_L                    (0x0010)
#define TIMEMARK_B5                      (0x0020)        /* */
#define TIMEMARK_B5_L                    (0x0020)
#define TIMEMARK_B6                      (0x0040)        /* */
#define TIMEMARK_B6_L                    (0x0040)
#define TIMEMARK_B7                      (0x0080)        /* */
#define TIMEMARK_B7_L                    (0x0080)
#define TIMEMARK_B8                      (0x0100)        /* */
#define TIMEMARK_B8_H                    (0x0001)
#define TIMEMARK_B9                      (0x0200)        /* */
#define TIMEMARK_B9_H                    (0x0002)
#define TIMEMARK_B10                     (0x0400)        /* */
#define TIMEMARK_B10_H                   (0x0004)
#define TIMEMARK_B11                     (0x0800)        /* */
#define TIMEMARK_B11_H                   (0x0008)
#define TIMEMARK_B12                     (0x1000)        /* */
#define TIMEMARK_B12_H                   (0x0010)
#define TIMEMARK_B13                     (0x2000)        /* */
#define TIMEMARK_B13_H                   (0x0020)
#define TIMEMARK_B14                     (0x4000)        /* */
#define TIMEMARK_B14_H                   (0x0040)
#define TIMEMARK_B15                     (0x8000)        /* */
#define TIMEMARK_B15_H                   (0x0080)

/* SAPH_AATM_C Control Bits */
#define TIMEMARK_C                       (0xffff)        /* */
#define TIMEMARK_C_L                     (0x00ff)
#define TIMEMARK_C_H                     (0x00ff)
#define TIMEMARK_C0                      (0x0001)        /* */
#define TIMEMARK_C0_L                    (0x0001)
#define TIMEMARK_C1                      (0x0002)        /* */
#define TIMEMARK_C1_L                    (0x0002)
#define TIMEMARK_C2                      (0x0004)        /* */
#define TIMEMARK_C2_L                    (0x0004)
#define TIMEMARK_C3                      (0x0008)        /* */
#define TIMEMARK_C3_L                    (0x0008)
#define TIMEMARK_C4                      (0x0010)        /* */
#define TIMEMARK_C4_L                    (0x0010)
#define TIMEMARK_C5                      (0x0020)        /* */
#define TIMEMARK_C5_L                    (0x0020)
#define TIMEMARK_C6                      (0x0040)        /* */
#define TIMEMARK_C6_L                    (0x0040)
#define TIMEMARK_C7                      (0x0080)        /* */
#define TIMEMARK_C7_L                    (0x0080)
#define TIMEMARK_C8                      (0x0100)        /* */
#define TIMEMARK_C8_H                    (0x0001)
#define TIMEMARK_C9                      (0x0200)        /* */
#define TIMEMARK_C9_H                    (0x0002)
#define TIMEMARK_C10                     (0x0400)        /* */
#define TIMEMARK_C10_H                   (0x0004)
#define TIMEMARK_C11                     (0x0800)        /* */
#define TIMEMARK_C11_H                   (0x0008)
#define TIMEMARK_C12                     (0x1000)        /* */
#define TIMEMARK_C12_H                   (0x0010)
#define TIMEMARK_C13                     (0x2000)        /* */
#define TIMEMARK_C13_H                   (0x0020)
#define TIMEMARK_C14                     (0x4000)        /* */
#define TIMEMARK_C14_H                   (0x0040)
#define TIMEMARK_C15                     (0x8000)        /* */
#define TIMEMARK_C15_H                   (0x0080)

/* SAPH_AATM_D Control Bits */
#define TIMEMARK_D                       (0xffff)        /* */
#define TIMEMARK_D_L                     (0x00ff)
#define TIMEMARK_D_H                     (0x00ff)
#define TIMEMARK_D0                      (0x0001)        /* */
#define TIMEMARK_D0_L                    (0x0001)
#define TIMEMARK_D1                      (0x0002)        /* */
#define TIMEMARK_D1_L                    (0x0002)
#define TIMEMARK_D2                      (0x0004)        /* */
#define TIMEMARK_D2_L                    (0x0004)
#define TIMEMARK_D3                      (0x0008)        /* */
#define TIMEMARK_D3_L                    (0x0008)
#define TIMEMARK_D4                      (0x0010)        /* */
#define TIMEMARK_D4_L                    (0x0010)
#define TIMEMARK_D5                      (0x0020)        /* */
#define TIMEMARK_D5_L                    (0x0020)
#define TIMEMARK_D6                      (0x0040)        /* */
#define TIMEMARK_D6_L                    (0x0040)
#define TIMEMARK_D7                      (0x0080)        /* */
#define TIMEMARK_D7_L                    (0x0080)
#define TIMEMARK_D8                      (0x0100)        /* */
#define TIMEMARK_D8_H                    (0x0001)
#define TIMEMARK_D9                      (0x0200)        /* */
#define TIMEMARK_D9_H                    (0x0002)
#define TIMEMARK_D10                     (0x0400)        /* */
#define TIMEMARK_D10_H                   (0x0004)
#define TIMEMARK_D11                     (0x0800)        /* */
#define TIMEMARK_D11_H                   (0x0008)
#define TIMEMARK_D12                     (0x1000)        /* */
#define TIMEMARK_D12_H                   (0x0010)
#define TIMEMARK_D13                     (0x2000)        /* */
#define TIMEMARK_D13_H                   (0x0020)
#define TIMEMARK_D14                     (0x4000)        /* */
#define TIMEMARK_D14_H                   (0x0040)
#define TIMEMARK_D15                     (0x8000)        /* */
#define TIMEMARK_D15_H                   (0x0080)

/* SAPH_AATM_E Control Bits */
#define TIMEMARK_E                       (0xffff)        /* */
#define TIMEMARK_E_L                     (0x00ff)
#define TIMEMARK_E_H                     (0x00ff)
#define TIMEMARK_E0                      (0x0001)        /* */
#define TIMEMARK_E0_L                    (0x0001)
#define TIMEMARK_E1                      (0x0002)        /* */
#define TIMEMARK_E1_L                    (0x0002)
#define TIMEMARK_E2                      (0x0004)        /* */
#define TIMEMARK_E2_L                    (0x0004)
#define TIMEMARK_E3                      (0x0008)        /* */
#define TIMEMARK_E3_L                    (0x0008)
#define TIMEMARK_E4                      (0x0010)        /* */
#define TIMEMARK_E4_L                    (0x0010)
#define TIMEMARK_E5                      (0x0020)        /* */
#define TIMEMARK_E5_L                    (0x0020)
#define TIMEMARK_E6                      (0x0040)        /* */
#define TIMEMARK_E6_L                    (0x0040)
#define TIMEMARK_E7                      (0x0080)        /* */
#define TIMEMARK_E7_L                    (0x0080)
#define TIMEMARK_E8                      (0x0100)        /* */
#define TIMEMARK_E8_H                    (0x0001)
#define TIMEMARK_E9                      (0x0200)        /* */
#define TIMEMARK_E9_H                    (0x0002)
#define TIMEMARK_E10                     (0x0400)        /* */
#define TIMEMARK_E10_H                   (0x0004)
#define TIMEMARK_E11                     (0x0800)        /* */
#define TIMEMARK_E11_H                   (0x0008)
#define TIMEMARK_E12                     (0x1000)        /* */
#define TIMEMARK_E12_H                   (0x0010)
#define TIMEMARK_E13                     (0x2000)        /* */
#define TIMEMARK_E13_H                   (0x0020)
#define TIMEMARK_E14                     (0x4000)        /* */
#define TIMEMARK_E14_H                   (0x0040)
#define TIMEMARK_E15                     (0x8000)        /* */
#define TIMEMARK_E15_H                   (0x0080)

/* SAPH_AATM_F Control Bits */
#define TIMEMARK_F                       (0xffff)        /* */
#define TIMEMARK_F_L                     (0x00ff)
#define TIMEMARK_F_H                     (0x00ff)
#define TIMEMARK_F0                      (0x0001)        /* */
#define TIMEMARK_F0_L                    (0x0001)
#define TIMEMARK_F1                      (0x0002)        /* */
#define TIMEMARK_F1_L                    (0x0002)
#define TIMEMARK_F2                      (0x0004)        /* */
#define TIMEMARK_F2_L                    (0x0004)
#define TIMEMARK_F3                      (0x0008)        /* */
#define TIMEMARK_F3_L                    (0x0008)
#define TIMEMARK_F4                      (0x0010)        /* */
#define TIMEMARK_F4_L                    (0x0010)
#define TIMEMARK_F5                      (0x0020)        /* */
#define TIMEMARK_F5_L                    (0x0020)
#define TIMEMARK_F6                      (0x0040)        /* */
#define TIMEMARK_F6_L                    (0x0040)
#define TIMEMARK_F7                      (0x0080)        /* */
#define TIMEMARK_F7_L                    (0x0080)
#define TIMEMARK_F8                      (0x0100)        /* */
#define TIMEMARK_F8_H                    (0x0001)
#define TIMEMARK_F9                      (0x0200)        /* */
#define TIMEMARK_F9_H                    (0x0002)
#define TIMEMARK_F10                     (0x0400)        /* */
#define TIMEMARK_F10_H                   (0x0004)
#define TIMEMARK_F11                     (0x0800)        /* */
#define TIMEMARK_F11_H                   (0x0008)
#define TIMEMARK_F12                     (0x1000)        /* */
#define TIMEMARK_F12_H                   (0x0010)
#define TIMEMARK_F13                     (0x2000)        /* */
#define TIMEMARK_F13_H                   (0x0020)
#define TIMEMARK_F14                     (0x4000)        /* */
#define TIMEMARK_F14_H                   (0x0040)
#define TIMEMARK_F15                     (0x8000)        /* */
#define TIMEMARK_F15_H                   (0x0080)

/* SAPH_ATBCTL Control Bits */
#define TCLR                             (0x0001)        /* */
#define TCLR_L                           (0x0001)
#define TSTART                           (0x0002)        /* */
#define TSTART_L                         (0x0002)
#define TSTOP                            (0x0004)        /* */
#define TSTOP_L                          (0x0004)
#define PSSV                             (0x00f0)        /* */
#define PSSV_L                           (0x00f0)
#define PSSV0                            (0x0010)        /* */
#define PSSV0_L                          (0x0010)
#define PSSV1                            (0x0020)        /* */
#define PSSV1_L                          (0x0020)
#define PSSV2                            (0x0040)        /* */
#define PSSV2_L                          (0x0040)
#define PSSV3                            (0x0080)        /* */
#define PSSV3_L                          (0x0080)

